artiller-performance.yaml
config:
  target: "http://localhost:4000"
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up
    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: Ramp up load
    - duration: 600
      arrivalRate: 50
      name: Sustained load

scenarios:
  - name: "Get all User"
    flow:
      - get:
          url: "/users"
          headers:
            Authorization: "Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpZCI6IjVmOWVjODc1LTA5ZGYtNDU4Ny1iZTZkLTdkZjMxNTAxODhlMCIsImxvZ2luIjoiYWRtaW4iLCJpYXQiOjE2NDQwNTY3Njl9.lYJqHrfBffmX7pnxanPJzolyL75lm_tgHYPC6-Y5LxQ"
      - get:
          url: "/users/5f9ec875-09df-4587-be6d-7df3150188e0"
          headers:
            Authorization: "Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpZCI6IjVmOWVjODc1LTA5ZGYtNDU4Ny1iZTZkLTdkZjMxNTAxODhlMCIsImxvZ2luIjoiYWRtaW4iLCJpYXQiOjE2NDQwNTY3Njl9.lYJqHrfBffmX7pnxanPJzolyL75lm_tgHYPC6-Y5LxQ"
      - post:
          url: "/boards"
          json:
            title: "Board"
            columns:
              - json:
                  title: "First column"
                  order: 0
                  test: "test"
          headers:
            Authorization: "Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpZCI6IjVmOWVjODc1LTA5ZGYtNDU4Ny1iZTZkLTdkZjMxNTAxODhlMCIsImxvZ2luIjoiYWRtaW4iLCJpYXQiOjE2NDQwNTY3Njl9.lYJqHrfBffmX7pnxanPJzolyL75lm_tgHYPC6-Y5LxQ"
      - think: 5